//---------------------------------------------------------------------------

#pragma once

// Подключение заголовочного файла библиотеки векторных и матричных операций
#include "linalg.h"
//---------------------------------------------------------------------------

// Опережающие декларации
class TModel;

// Базовый класс интегратора
class TIntegrator
{
    protected:
        // Максимально допустимая относительная погрешность (на шаге)
        long double e_max;

    public:
        // Базовый конструктор
        TIntegrator() : e_max( 1e-8L ) {}

        // Установка величины максимальной относительной погрешности
        inline void setRelTol( long double e_max ) { this->e_max = e_max; }

        // Получение величины максимальной относительной погрешности
        inline long double getRelTol() const { return e_max; }

        // Абстрактный метод, реализующий процедуру численного интегрирования
        virtual void Run(TModel* Model) = 0;
};

//---------------------------------------------------------------------------
// Метод численного интегрирования Дормана-Принса 4(5) порядка точности с коррекцией шага и плотной выдачей
class TDormandPrinceIntegrator : public TIntegrator
{
    private:
        // Коэффициенты a, b, c
        static const long double c[7], a[7][6], b4[7], b5[7];
        // Коэффициенты K[i]
        TVector K[7];
        // Машинный "эпсилон"
        long double u;

    public:
        TDormandPrinceIntegrator();
        void Run(TModel* Model) override;
};

//---------------------------------------------------------------------------

