//---------------------------------------------------------------------------

#ifndef modelH
#define modelH

// Подключение заголовочного файла библиотеки векторных и матричных операций
#include "linalg.h"

//---------------------------------------------------------------------------
// Базовый класс модели для интегратора

class TModel
{
    protected:
        // Начальные условия
        TVector X0_;
        // Требуемый от интегратора интервал выдачи результатов
        long double step_;
        // Начало и окончание времени интегрирования
        long double t0_, t1_;
        // Хранилище результатов
        TMatrix Result;
        // Счётчик строк в матрице результатов
        int N;

    public:
        // Общий конструктор моделей - инициализация параметров по умолчанию
        TModel()
            : step_( 1e-1L )
            , t0_( 0.0L )
            , t1_( 1.0L )
            , N( 0 )
        {}

        // Абстрактная перегружаемая функция правых частей ДУ (X - вектор состояния, t - независимый аргумент)
        virtual TVector getRight( const TVector& X, long double t ) = 0;

        // Получение начальных условий
        inline TVector X0() const { return X0_; }

        // Порядок системы - по размерности вектора начальных условий
        inline int getOrder() const { return (int)X0_.size(); }

        // Интервал выдачи результатов
        inline long double step() const { return step_; }

        // Управление временным интервалом интегрирования
        inline long double t0() const { return t0_; }
        inline long double t1() const { return t1_; }

        // Получение матрицы результатов
        inline TMatrix getResult() const { return Result; }

        // Запись результатов (в этом методе в наследнике допустимо организовать запись в файл
        // вместо или вместе с наполнением матрицы результатов)
        virtual void addResult( const TVector& X, long double t );

        // Очистка матрицы результатов (или файла с результатами)
        virtual void clearResult();

        // Подготовка матрицы результатов для более эффективного выделения памяти
        virtual void prepareResult();
};

//---------------------------------------------------------------------------

#endif
